print("На замут пришёл?")

bank = float(input("Скок дениг? ☺ "))
if bank == 500 or bank < 1200:
    print("Мало, ебать")
    print("трава нужна, ебать? Бабки сука, лоховской по 500, но обдроченные кропали для опустившихся нищих ")
    hash_vlq = int(input("Ну блять? Всё сливаешь или сколько нахуй? "))
    print("Мало пиздец ебать, шваркотня химозная, по 500 и ту нахуй не всегда целкой берут, я в ааахуе бляяяя")
    print("хуесос блять, солевой небось? Те хватает на ", round((hash_vlq // 50)*0.1, 2), "кус говна")

    print("съёбывай")

if bank >= 1200:
    if bank >= 1200:
        print("Много ебать, бери пон, по 1200, ахуенный, хватает на", round(bank // 120) * 0.1)
        buds_vhq = int(input("Ну чё? Скок заряжаешь? "))
        print("Заебись, держи свои", round((buds_vhq// 120)*0.1), "качественных бадсов")
        print("красавчик, пон- сила ☺")
5